Repository: qlolxlolp/g--blockchainnetworkanalyzer-blockchainnetworkanalyzer
Catalog: Resources/Strings.*.resx
Languages: fa

# MainWindowTitle
source: Blockchain Network Analyzer Premium - Enterprise Edition
fa: تحلیلگر شبکه بلاک‌چین پیشرفته - نسخه سازمانی

# AppTitle
source: Blockchain Network Analyzer
fa: تحلیلگر شبکه بلاک‌چین

# VersionText
source: Premium Enterprise Edition v1.0
fa: نسخه سازمانی پیشرفته v1.0

# IPConfigurationTab
source: IP Configuration
fa: پیکربندی IP

source: IP Selection Mode
fa: حالت انتخاب IP

source: Select IP Input Mode
fa: حالت ورودی IP را انتخاب کنید

source: Single IP Address
fa: آدرس IP واحد

# IPRange
source: IP Range (Start - End)
fa: محدوده IP (شروع - پایان)

source: Random IP Generation
fa: تولید IP تصادفی

source: Serial IP Generation
fa: تولید IP سریالی

source: Custom IP List
fa: لیست IP سفارشی

source: IP Address
fa: آدرس IP

source: Start IP
fa: IP شروع

source: End IP
fa: IP پایان

source: Number of Random IPs
fa: تعداد IP های تصادفی

source: Base IP Address
fa: آدرس IP پایه

source: Number of IPs
fa: تعداد IP ها

# EnterIPs
source: Enter IPs (one per line or comma-separated)
fa: IP ها را وارد کنید (هر کدام در یک خط یا جدا شده با کاما)

source: Port Configuration
fa: پیکربندی پورت

source: Use Default Blockchain Ports
fa: استفاده از پورت های پیش‌فرض بلاک‌چین

source: Custom Ports
fa: پورت های سفارشی

source: Scan All Common Blockchain Ports
fa: اسکن تمام پورت های رایج بلاک‌چین

# EnterPorts
source: Enter ports (comma-separated)
fa: پورت ها را وارد کنید (جدا شده با کاما)

source: Scan Options
fa: گزینه های اسکن

# EnableFakeIPDetection
source: Enable Fake IP Detection (99.99% of IP changers use fake IPs)
fa: فعال کردن تشخیص IP جعلی (99.99% از تغییر دهنده های IP از IP جعلی استفاده می‌کنند)

source: Enable Blockchain Detection
fa: فعال کردن تشخیص بلاک‌چین

source: Enable Port Scanning
fa: فعال کردن اسکن پورت

source: Timeout
fa: زمان انتظار

source: Concurrent
fa: همزمان

source: Start Network Scan
fa: شروع اسکن شبکه

# ScanResultsTab
source: Scan Results
fa: نتایج اسکن

source: Total Scanned
fa: کل اسکن شده

source: Hosts Found
fa: هاست های یافت شده

source: Blockchain Detected
fa: بلاک‌چین تشخیص داده شده

source: Fake IPs Detected
fa: IP های جعلی تشخیص داده شده

source: Export Results
fa: صدور نتایج

# StatisticsTab
source: Statistics
fa: آمار

source: Scan Statistics and Analytics
fa: آمار و تحلیل اسکن

# StatisticsPlaceholder
source: Statistics and charts will be displayed here
fa: نمودارها و آمار در اینجا نمایش داده خواهد شد

# SettingsTab
source: Settings
fa: تنظیمات

source: Application Settings
fa: تنظیمات برنامه

source: Database Configuration
fa: پیکربندی پایگاه داده

source: Database Path
fa: مسیر پایگاه داده

source: Advanced Options
fa: گزینه های پیشرفته

source: Enable Audit Logging
fa: فعال کردن ثبت وقایع حسابرسی

source: Enable Automatic Database Backup
fa: فعال کردن پشتیبان گیری خودکار پایگاه داده

source: Save Settings
fa: ذخیره تنظیمات

source: Ready
fa: آماده

source: Configuration Error
fa: خطای پیکربندی

# ConfigureCorrectly
source: Please configure IP selection and ports correctly.
fa: لطفا انتخاب IP و پورت ها را به درستی پیکربندی کنید.

source: Initializing scan...
fa: در حال مقداردهی اولیه اسکن...

source: Scan completed
fa: اسکن کامل شد

source: Scan failed
fa: اسکن شکست خورد

source: Scan Error
fa: خطای اسکن

source: Failed to start scan
fa: شکست در شروع اسکن

source: Error
fa: خطا

source: Scanning...
fa: در حال اسکن...

source: No results to export.
fa: هیچ نتیجه ای برای صدور وجود ندارد.

source: Export
fa: صدور

source: Results exported successfully.
fa: نتایج با موفقیت صادر شد.

source: Export Error
fa: خطای صدور

source: Failed to export results
fa: شکست در صدور نتایج
